In [15]:
# Lesson: 파이썬 Pandas 초급 튜토리얼

# Pandas 가져오기
import pandas as pd

# DataFrame 생성하기
data = {'name': ['Alice', 'Bob', 'Charlie', 'james', 'Alice', 'Bob', 'Charlie', 'james'],
        'age': [25, 30, 35, 30, 25, 30, 35, 30],
        'city': ['뉴욕', '파리', '런던', '서울', '뉴욕', '파리', '런던', '서울']}
df = pd.DataFrame(data)
print(type(df))

df.head()

<class 'pandas.core.frame.DataFrame'>

      name  age city
0    Alice   25   뉴욕
1      Bob   30   파리
2  Charlie   35   런던
3    james   30   서울
4    Alice   25   뉴욕

In [16]:
# 데이터 접근하기
print("\n데이터 접근하기:")
print("이름 열:")
name_city = df[['name', 'city']]

데이터 접근하기:
이름 열:

In [17]:
name_city

      name city
0    Alice   뉴욕
1      Bob   파리
2  Charlie   런던
3    james   서울
4    Alice   뉴욕
5      Bob   파리
6  Charlie   런던
7    james   서울

In [18]:
print("첫 번째 행:")
print(df.iloc[0:3])
print("특정 셀:")
print(df.at[1, 'name'])

첫 번째 행:
      name  age city
0    Alice   25   뉴욕
1      Bob   30   파리
2  Charlie   35   런던
특정 셀:
Bob

In [19]:
# 요약 통계량
print("\n요약 통계량:")
print("평균 나이:", df['age'].mean())
print("최대 나이:", df['age'].max())
print("최소 나이:", df['age'].min())

요약 통계량:
평균 나이: 30.0
최대 나이: 35
최소 나이: 25

In [20]:
# 데이터 필터링
# print("\n데이터 필터링:")
# filtered_df = df[df['age'] > 30]
# print("필터링된 DataFrame:")
# print(filtered_df)

# 데이터 정렬
print("\n데이터 정렬:")
sorted_df = df.sort_values(by='age', ascending=False)
print("정렬된 DataFrame:")
print(sorted_df)

데이터 정렬:
정렬된 DataFrame:
      name  age city
2  Charlie   35   런던
6  Charlie   35   런던
1      Bob   30   파리
3    james   30   서울
5      Bob   30   파리
7    james   30   서울
0    Alice   25   뉴욕
4    Alice   25   뉴욕

In [21]:
# 새로운 열 추가하기
df['salary'] = [50000, 60000, 70000, 400000, 50000, 60000, 70000, 400000]
print("\n월급 열이 추가된 DataFrame:")
print(df)

# 열 삭제하기
df = df.drop('city', axis=1)
print("\n도시 열을 삭제한 DataFrame:")
print(df)

월급 열이 추가된 DataFrame:
      name  age city  salary
0    Alice   25   뉴욕   50000
1      Bob   30   파리   60000
2  Charlie   35   런던   70000
3    james   30   서울  400000
4    Alice   25   뉴욕   50000
5      Bob   30   파리   60000
6  Charlie   35   런던   70000
7    james   30   서울  400000

도시 열을 삭제한 DataFrame:
      name  age  salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
3    james   30  400000
4    Alice   25   50000
5      Bob   30   60000
6  Charlie   35   70000
7    james   30  400000

In [22]:
df.to_csv('my_data.csv')

In [23]:
# CSV 파일로부터 읽기
csv_data = pd.read_csv('my_data.csv')
print("\nCSV 파일로부터 읽은 데이터: \n")
print(csv_data)

CSV 파일로부터 읽은 데이터:

   Unnamed: 0     name  age  salary
0           0    Alice   25   50000
1           1      Bob   30   60000
2           2  Charlie   35   70000
3           3    james   30  400000
4           4    Alice   25   50000
5           5      Bob   30   60000
6           6  Charlie   35   70000
7           7    james   30  400000

In [24]:
# 컬럼명 바꾸기
csv_data = csv_data.rename(columns={"Unnamed: 0": "바꾼 컬럼명"})
print(csv_data)

   바꾼 컬럼명     name  age  salary
0       0    Alice   25   50000
1       1      Bob   30   60000
2       2  Charlie   35   70000
3       3    james   30  400000
4       4    Alice   25   50000
5       5      Bob   30   60000
6       6  Charlie   35   70000
7       7    james   30  400000

In [25]:
# 중복되는 인덱스 컬럼 하나 삭제
csv_data.drop("바꾼 컬럼명", axis=1, inplace=True)
print(csv_data)

      name  age  salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
3    james   30  400000
4    Alice   25   50000
5      Bob   30   60000
6  Charlie   35   70000
7    james   30  400000

In [26]:
# 영어로 되어있는 name 한국어로 바꾸기
name_mapping = {
    'Alice': '앨리스',
    'Bob': '밥',
    'Charlie': '찰리',
    'James': '제임스'
}

csv_data['name'] = csv_data['name'].map(name_mapping)
csv_data

  name  age  salary
0  앨리스   25   50000
1    밥   30   60000
2   찰리   35   70000
3  NaN   30  400000
4  앨리스   25   50000
5    밥   30   60000
6   찰리   35   70000
7  NaN   30  400000

In [27]:
csv_data['salary'] = csv_data['salary'].apply(lambda x: "{:,}".format(x))
csv_data

  name  age   salary
0  앨리스   25   50,000
1    밥   30   60,000
2   찰리   35   70,000
3  NaN   30  400,000
4  앨리스   25   50,000
5    밥   30   60,000
6   찰리   35   70,000
7  NaN   30  400,000

In [28]:
csv_data.to_csv('my_data2.csv')